PUFoam-master1/testCase/results/0/TS.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      TS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    Wall
    {
        type            zeroGradient;
    }
    atmosphere
    {  
	/*type		fixedValue;
	value		uniform 300;*/
	type		zeroGradient;
	// type		inletOutlet;
	// inletValue	$internalField;
	// value		$internalField;

    }
axis1
    {
        type    symmetryPlane;
    }
axis2
    {
        type    symmetryPlane;
    }
    
}

// ************************************************************************* //
