PUFoam-master1/testCase/results/0/alpha.gas
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
800
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    Wall
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    atmosphere
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
