PUFoam-master1/testCase/results/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// CoEuler
// CrankNicolson
// Euler
// SLTS (only steady state)
// backward
// bounded
// localEuler
// steadyState
ddtSchemes
{
    default         Euler;		// first-order
}

gradSchemes
{
    default         Gauss linear;	// sigma(S_f phi_f)
}

divSchemes
{
    div(phi,alpha)  Gauss vanLeer;
    div(phirb,alpha) Gauss interfaceCompression 1;	//alphaEqn.H L7, 58 & look at eq. 4.13 Rusche's PhD

    div(rhoPhi,U)  Gauss upwind;
    div(phi,thermo:rhofoam) Gauss upwind; 
    div(phi,thermo:rhoair) Gauss upwind;
    div(rhoPhi,T)    Gauss upwind; 
    div(rhoPhi,K)    Gauss upwind;
    div(phi,K)         Gauss upwind;
    div(phi,p)        Gauss upwind;
    div(phi,k)        Gauss upwind;
    div(phi,rho_gas)  Gauss upwind; 
    div(phi,rho_foam) Gauss upwind; 
    div(rhoPhi,TS)    Gauss upwind;
    div(phi,p_rgh)      Gauss upwind;
    div(phi,TS)        Gauss upwind; 
    div((interpolate(alpha.gas)*(mag((phi|magSf))*nHatf)),TS)   Gauss linear;
    
    div((interpolate(alpha.gas)*(mag((phi|magSf))*nHatf)),rho)  Gauss linear;
    div((interpolate(alpha.gas)*(mag((phi|magSf))*nHatf)),rho_foam)   Gauss linear;

    div((muEff*dev2(T(grad(U))))) Gauss linear;
    div((muMixture*dev2(T(grad(U))))) Gauss linear;
    div((interpolate(alpha.gas)*phi),rho_gas) Gauss linear;
    div((interpolate(alpha.foam)*phi),rho_foam) Gauss linear;

// For Moments
    div(phi,mZero)   Gauss upwind;
    div(phi,mOne)    Gauss upwind;
    div(phi,mTwo)    Gauss upwind;
    div(phi,mThree)  Gauss upwind;
    div(phi,mFour)   Gauss upwind;	
    div(phi,mFive)   Gauss upwind;

    div((interpolate(alpha.gas)*(mag((phi|magSf))*nHatf)),mZero)   Gauss upwind;     
    div((interpolate(alpha.gas)*(mag((phi|magSf))*nHatf)),mOne)   Gauss upwind;
    div((interpolate(alpha.gas)*(mag((phi|magSf))*nHatf)),mTwo)   Gauss upwind;
    div((interpolate(alpha.gas)*(mag((phi|magSf))*nHatf)),mThree)   Gauss upwind;
    div((interpolate(alpha.gas)*(mag((phi|magSf))*nHatf)),mFour)   Gauss upwind;
    div((interpolate(alpha.gas)*(mag((phi|magSf))*nHatf)),mFive)   Gauss upwind;

    div((muMixture*dev2(grad(U).T()))) Gauss linear; 
    div((muEff*dev(T(grad(U))))) Gauss linear; 
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;

// For Kinetics
    div(phi,wBA_l)   Gauss upwind;
    div(phi,wBA_g)   Gauss upwind;
    div(phi,wCO2_g)   Gauss upwind;
    div(phi,wCO2_l)   Gauss upwind;
    div(phi,XOH)   Gauss upwind;
    div(phi,XW)   Gauss upwind;

    div((interpolate(alpha.gas)*(mag((phi|magSf))*nHatf)),wBA_g)   Gauss upwind;   
    div((interpolate(alpha.gas)*(mag((phi|magSf))*nHatf)),wBA_l)   Gauss upwind;   
    div((interpolate(alpha.gas)*(mag((phi|magSf))*nHatf)),wCO2_g)   Gauss upwind;   
    div((interpolate(alpha.gas)*(mag((phi|magSf))*nHatf)),wCO2_l)   Gauss upwind;
    div((interpolate(alpha.gas)*(mag((phi|magSf))*nHatf)),XOH)   Gauss upwind;   
    div((interpolate(alpha.gas)*(mag((phi|magSf))*nHatf)),XW)   Gauss upwind;  

    div((((interpolate(alpha2))*rho_foam)*phi),wCO2_l)	Gauss upwind;
    div((((interpolate(alpha2))*rho_foam)*phi),wCO2_g)	Gauss upwind;
    div((((interpolate(alpha2))*rho_foam)*phi),wBA_g)	Gauss upwind;
    div((((interpolate(alpha2))*rho_foam)*phi),wBA_l)	Gauss upwind;
    div((((interpolate(alpha2))*rho_foam)*phi),XOH)	Gauss upwind;
    div((((interpolate(alpha2))*rho_foam)*phi),XW)	Gauss upwind;
  
    div((interpolate(rhoFoamAlpha2)*phi),XW)	Gauss upwind;
    div((interpolate(rhoFoamAlpha2)*phi),XOH)	Gauss upwind;
    div((interpolate(rhoFoamAlpha2)*phi),wBA_l)	Gauss upwind;
    div((interpolate(rhoFoamAlpha2)*phi),wBA_g)	Gauss upwind;
    div((interpolate(rhoFoamAlpha2)*phi),wCO2_l)	Gauss upwind;
    div((interpolate(rhoFoamAlpha2)*phi),wCO2_g)	Gauss upwind;
    
    div((interpolate(rhoFoamAlpha2)*phi),XNCO) Gauss upwind; 

    div((interpolate(rhoFoamAlpha2)*phi),TS)    Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         midPoint;		// central differencing
}

snGradSchemes
{
    default         uncorrected;	// corrected option: calculate the surface normal gradient with non-orthogonal correction
}

fluxRequired
{
    default         no;
    alpha.gas;
    p_rgh;
    pcorr;
}

// ************************************************************************* //
