PUFoam-master1/testCase/results/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.gas 1
    volScalarFieldValue wBA_l 0
    volScalarFieldValue mZero 0
    volScalarFieldValue mOne 0
    volScalarFieldValue mTwo 0
    volScalarFieldValue mThree 0
    volScalarFieldValue mFour 0
    volScalarFieldValue mFive 0
    volScalarFieldValue M0 0
    volScalarFieldValue M1 0
    volScalarFieldValue M2 0
    volScalarFieldValue M3 0
    volScalarFieldValue M4 0
    volScalarFieldValue M5 0
    volScalarFieldValue rho_foam 1.2
    volScalarFieldValue rho_gas 1.2
    volScalarFieldValue weight0 0
    volScalarFieldValue weight1 0
    volScalarFieldValue weight2 0
    volScalarFieldValue node0 0
    volScalarFieldValue node1 0
    volScalarFieldValue node2 0
    volScalarFieldValue TS 298
);

regions
(
    boxToCell
    {
        box (0 0 0) (0.1 0.01 0.01);

        fieldValues
        (
        volScalarFieldValue alpha.gas 0
	    volScalarFieldValue wBA_l 0.057
	    volScalarFieldValue mZero 1.0e+13
	    volScalarFieldValue mOne 5.2622e-6
	    volScalarFieldValue mTwo 2.7969e-24
	    volScalarFieldValue mThree 1.5015e-42
        volScalarFieldValue mFour 8.1421e-61
        volScalarFieldValue mFive 4.4594e-79
        volScalarFieldValue M0 9.9999e12
        volScalarFieldValue M1 5.2622e-6
        volScalarFieldValue M2 2.7969e-24
        volScalarFieldValue M3 1.5015e-42
        volScalarFieldValue M4 8.1421e-61
        volScalarFieldValue M5 4.4594e-79
	    volScalarFieldValue rho_foam 1100.0
	    volScalarFieldValue rho_gas 1e-8
	    volScalarFieldValue muFoamCorr 1e-3
	    volScalarFieldValue muMixture  1e-3
	    volScalarFieldValue muFoam  1e-3
        volScalarFieldValue weight0 5.72635e+12
        volScalarFieldValue weight1 4.27365e+12
        volScalarFieldValue weight2 3.43594e+12
        volScalarFieldValue node0 4.8065e-19
        volScalarFieldValue node1 5.8728e-19
        volScalarFieldValue node2 5.97756e-19
        volScalarFieldValue TS 300
        volScalarFieldValue p_rgh 1e5
        volScalarFieldValue p 1e5
        );
    }

);


// ************************************************************************* //
